//
/*
 * 정답
 * ==========================================================================
 *
 * ==========================================================================
 * 문제 설명
 * ==========================================================================
 * 소들이 있는데 각 소들은 축사의 start ~ end만큼 차지한다.
 * 각 소는 자기가 위치한 축사의 온도를 최소 c만큼 낮추고 싶어한다.
 * 에어컨을 가동하면 start ~ end까지의 범위의 온도를 c만큼 낮출 수 있다.
 * 이 때, 최소의 돈으로 모든 소들이 만족할 만큼 축사의 온도를 낮추는 돈을 구하시오.
 * ==========================================================================
 * 예제
 * ==========================================================================
 * 2 4
 * 1 5 2
 * 7 9 3
 * 2 9 2 3
 * 1 6 2 8
 * 1 2 4 2
 * 6 9 1 5
 *
 * 소 2마리, 에어컨 4대
 * 첫번째 소 : 1 ~ 5까지 공간 차지, 최소 2도를 낮추면 좋겠음
 * 두번째 소 : 7 ~ 9까지 공간 차지, 최소 3도를 낮추면 좋겠음
 * ==========================================================================
 * 코드의 구현
 * ==========================================================================
 *
 * ==========================================================================
 */

#include <bits/stdc++.h>

#define in :
using namespace std;
using ll = long long;
using pii = pair<int, int>;
using dv = vector<vector<int>>;

int main()
{
    cin.tie(nullptr), cout.tie(nullptr), ios::sync_with_stdio(false);

#ifdef NDEBUG
    freopen("input.txt", "r", stdin);
#endif



    return 0;
}